{
  "content_about": [
    "HackNU - 24-часовой кодинг-марафон, в котором студенты со всего Казахстана смогут проявить себя решая задачи предоставленные Казахстанскими IT-компаниями Chocofamily, ZeroToOneLabs, Колёса|Крыша|Маркет и ЦАРКА. Главным критерием для определения победителей хакатона будет качество самого технического решения. Победители будут определяться специальным жюри, в которое будут входить представители компаний предоставляющих задачи. В течении 24 часов участникам будет доступно менторство от организаторов и самих компаний. Хакатон будет проводится на территории кампуса Назарбаев Университета. Всем участникам предоставляется питание и подарки от организаторов.",
    "Для того, чтобы участвовать в хакатоне нужно зарегистрировать команду и выбрать задачу. Описания задач и количество участников доступны ниже."
  ],
  "content_workshops": [
    {
      "name": "Андрей Шевченко. Место: TBA",
      "date": "5 Апреля, 19:00"
    },
    {
      "name": "Евгений Шутилин. Место: TBA",
      "date": "10 Апреля, 19:00"
    },
    {
      "name": "ЦАРКА. Место: TBA",
      "date": "11 Апреля, 19:00"
    }
  ],
  "content_timetable": [
    {
      "date": "Март 31 - День 1",
      "timetable": [
        {
          "time": "10:00 - 12:00",
          "name": "Регистрация участников"
        },
        {
          "time": "12:00 - 13:00",
          "name": "Церемония открытия"
        },
        {
          "time": "13:00 - 00:00",
          "name": "24-часовой хакатон"
        }
      ]
    },
    {
      "date": "Апрель 1 - День 2",
      "timetable": [
        {
          "time": "00:00 - 13:00",
          "name": "24-часовой хакатон"
        },
        {
          "time": "13:00 - 15:00",
          "name": "Презентация работ"
        },
        {
          "time": "15:00 - 15:30",
          "name": "Перерыв"
        },
        {
          "time": "15:30 - 17:30",
          "name": "Презентация работ"
        },
        {
          "time": "17:30 - 18:00",
          "name": "Судейство"
        },
        {
          "time": "18:00 - 18:30",
          "name": "Церемония закрытия"
        }
      ]
    }
  ],
  "content_sections": {
    "info": "Команды могут зарегестрироваться только на одну задачу. В команде может быть не более трех участников.",
    "sections": [
      {
        "name": "ZeroToOneLabs",
        "owner": "../imgs/0to1labs.png",
        "problems": [
          {
            "name": "1",
            "content": [
              "Написать приложение для Назарбаев Университета, которое будет решать/облегчать те или иные аспекты жизни студентов. Основным требованием является разработка приложения на технологии blockstack.org"
            ]
          }
        ],
        "prizes": "Главный приз - стажировка в компании. \n 1 место - 60'000 тг. 2 место - 40'000 тг. 3 место - утешительный приз."
      },
      {
        "name": "CAICA",
        "owner": "../imgs/caica.png",
        "problems": [
          {
            "name": "1",
            "content": [
              "Участникам дан сайт, на котором реализована функция регистрация команды. На сайте есть счетчик, при нажатии на кнопку, команде начисляется +1 очко (к примеру). Для активации функции счетчика участникам необходимо обойти google captcha: 1) Я не робот; 2) Выделение подходящих под условие областей фотографии."
            ]
          },
          {
            "name": "2",
            "content": [
              "Реализовать обфускатор бинарного приложения, позволяющий обойти обнаружение антивирусным ПО. Обфусцированное приложение должно полностью сохранять свой исходный функционал, но при этом должно также успешно пройти проверку тремя распространенными в Казахстане антивирусными программными средствами: Kaspersky, Eset, Dr. Web. Размер приложения, полученного в результате обфускации, не должен превышать размер исходного бинарного файла более чем в два раза. Обфускатор должен учитывать наличие сигнатурного анализа в указанных антивирусных программных средствах, а также приблизиться к обходу проактивной защиты."
            ]
          },
          {
            "name": "3",
            "content": [
              "Участникам необходимо реализовать веб-приложение с функционалом ответа на вопросы про популярную в Казахстане тему на сегодняшний день. Чтобы пройти тестирование пользователям необходимо иметь личную страницу в социальной сети. Данное веб-приложение должно собирать персональные данные пользователей, которые проходили тестирование, с их страниц в социальной сети."
            ]
          },
          {
            "name": "4",
            "content": [
              "Написать скрипт, который будет анализировать тональность сообщений в группе телеграм на английском языке с помощью искусственной нейронной сети. Полное описание задачи доступно по ссылке: http://telegra.ph/Zadacha-dlya-zelenyh-03-28"
            ]
          }
        ],
        "prizes": "Главный приз - стажировка в компании. \n 1 место - смартфон xiaomi MI A1. 2 место - беспроводные наушники. 3 место - проводные наушники"
      },
      {
        "name": "Chocolife",
        "owner": "../imgs/chocofamily.png",
        "problems": [
          {
            "name": "1",
            "content": [
              "Написать бота для поиска авиабилетов в любом мессенждере."
            ]
          },
          {
            "name": "2",
            "content": [
              "Написать бота, для трекинга цены по определенному направлению в любом мессенджере."
            ]
          },
          {
            "name": "3",
            "content": [
              "Для выявления доставляет ли заведение определенному клиенту по его координатам и получения условий доставки необходима сущность квадрата(полигон) доставки. Для того, чтобы создавать квадраты доставки необходим удобный функционал создания этих квадратов. Функционал должен учесть максимум потребностей заведений так как от местоположения клиента может меняться практически всё. Например, у заведения может быть несколько точек доставки и соответственно различные условия их работы, у заведения может изменяться меню в зависимости от этих точек и т.д."
            ],
            "files": [
              {
                "name": "Подробное описание",
                "path": "../files/ТЗ_Chocofood.odt"
              }
            ]
          }
        ],
        "prizes": "Главный приз - стажировка в компании."
      },
      {
        "name": "Kolesa",
        "owner": "../imgs/kolesa.png",
        "problems": [
          {
            "name": "1",
            "content": [
              "В компании Колеса Крыша Маркет есть 3 интересных продукта, которыми пользуются многие казахстанцы. И в каждом из них множество услуг, которые надо предлагать пользователям, которым они действительно нужны. Предсказать какая именно услуга нужна конкретному пользователю целое искусство. Предлагаем вам сделать первые шаги в данной области и попытаться решить одну из самых распространённых рабочих задач data scientist-а: прогнозирование покупки определенной услуги. Данная задача является задачей бинарной классификацией."
            ],
            "files": [
              {
                "name": "Подробное описание",
                "path": "../files/ТЗ_Классификация.docx"
              }
            ]
          },
          {
            "name": "2",
            "content": [
              "Необходимо разработать мобильное приложение «Библиотека», которое позволяет упростить процесс круговорота книг во внутренней библиотеке компании с возможностью взять интересующую книгу и видеть у кого находится необходимая вам на чтении."
            ],
            "files": [
              {
                "name": "Подробное описание",
                "path": "../files/ТЗ_Библиотека.docx"
              }
            ]
          }
        ],
        "prizes": "Главный приз - стажировка в компании."
      }
    ]
  },
  "content_supporters": [
    {
      "path": "../imgs/caica.png"
    }
  ]
}
